app/controllers/fbdetails_controller.rb

INSERT INTO `fbdetails` (`bio`, `created_at`, `gender`, `hometown`, `location`, `name`, `uid`, `updated_at`, `user_name`) VALUES ('Testing', '2013-09-12 16:42:31', 'male', 'Ongole', 'Hyderabad, Andhra Pradesh', 'Ramanjaneyulu Arudra', '100002564184068', '2013-09-12 16:42:31', 'ramanjaneyulu.arudra')
---
	def create
		@fb_detail = Fbdetail.new
		@FBGraph = Koala::Facebook::API.new(params[:access_token])
		@graph = @FBGraph.get_object("me")

		@fb_detail.uid = @graph["id"]
		@fb_detail.name = @graph["name"]
		@fb_detail.user_name = @graph["username"]
		@fb_detail.gender = @graph["gender"]
		@fb_detail.hometown = @graph["hometown"]["name"]
		@fb_detail.bio = @graph["bio"]
		@fb_detail.location = @graph["location"]["name"]

		@fb_detail.save

SELECT `fbdetails`.* FROM `fbdetails`
---
	def index
		@fbdetails = Fbdetail.all